#Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'

#Binaries
brew 'bash' # Latest Bash version
brew 'coreutils' # Those that come with macOS are outdated
brew 'git'
brew 'grep'
brew 'mas' # Mac App Store manager

#Development
brew 'php'
brew 'php@7.3'
brew 'php@7.4'
brew 'composer'
brew 'imagemagick'
brew 'mkcert'
brew 'mysql'
brew 'nginx'
brew 'node'
brew 'yarn'

#Apps
cask '1password'
cask 'android-studio'
cask 'brave-browser'
cask 'dropbox'
cask 'figma'
cask 'firefox'
cask 'github'
cask 'google-chrome'
cask 'hyper'
cask 'kaleidoscope'
cask 'karabiner-elements'
cask 'logi-options-plus'
cask 'mongodb-compass'
cask 'nordvpn'
cask 'principle'
cask 'qbittorrent'
cask 'raycast'
cask 'react-native-debugger'
cask 'sequel-pro'
cask 'sketch'
cask 'spotify'
cask 'steam'
cask 'sublime-text'
cask 'transmit'
cask 'virtualbox'
cask 'visual-studio-code'
cask 'vlc'
cask 'zoom'

# Quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'qlimagesize'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'
cask 'webpquicklook'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-roboto-condensed'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Mac App Store
mas 'Bear', id: 1091189122
mas 'Divvy', id: 413857545
mas 'Harvest', id: 506189836
mas 'LittleIpsum', id: 405772121
mas 'Pixelmator Pro', id: 1289583905
mas 'Slack', id: 803453959
